Revit 2026 API

# AnalyticalSupportPriority Enumeration

---

Defines how "highly" another Element is giving support for one Element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalSupportPriority
```
```vb
Public Enumeration AnalyticalSupportPriority
```
```cpp
public enum class AnalyticalSupportPriority
```
```fsharp
type AnalyticalSupportPriority
```

| Member name | Value | Description |
| --- | --- | --- |
| FourthHigestPriority | 4 |  |
| HighestPriority | 1 |  |
| SecondHighestPriority | 2 |  |
| ThirdHighestPriority | 3 |  |
| UnknownPriority | 0 | Priority has not been determined. |

For instance, a Column may be a higher priority for a Beam than another Beam. This is useful to find the best supports for a given Element.

#### Reference

Autodesk.Revit.DB.Structure Namespace